[
  {"title": "Inception", "genres": "Sci-Fi,Thriller", "description": "A thief who steals corporate secrets through dream-sharing technology is given the inverse task of planting an idea into the mind of a CEO."},
  {"title": "The Dark Knight", "genres": "Action,Crime,Drama", "description": "Batman faces the Joker, a criminal mastermind who plunges Gotham City into chaos."},
  {"title": "Interstellar", "genres": "Sci-Fi,Drama,Adventure", "description": "A team of explorers travel through a wormhole in space in an attempt to ensure humanity's survival."},
  {"title": "The Matrix", "genres": "Sci-Fi,Action", "description": "A computer hacker learns about the true nature of his reality and his role in the war against its controllers."},
  {"title": "Forrest Gump", "genres": "Drama,Romance", "description": "The presidencies of Kennedy and Johnson, the Vietnam War, and more through the eyes of an Alabama man."},
  {"title": "Pulp Fiction", "genres": "Crime,Drama", "description": "The lives of two mob hitmen, a boxer, and others intertwine in four tales of violence and redemption."},
  {"title": "The Shawshank Redemption", "genres": "Drama,Crime", "description": "Two imprisoned men bond over a number of years, finding solace and eventual redemption through acts of common decency."},
  {"title": "Fight Club", "genres": "Drama", "description": "An insomniac office worker and a soap maker form an underground fight club that evolves into something much more."},
  {"title": "The Godfather", "genres": "Crime,Drama", "description": "The aging patriarch of an organized crime dynasty transfers control to his reluctant son."},
  {"title": "The Godfather: Part II", "genres": "Crime,Drama", "description": "The early life and career of Vito Corleone is portrayed while his son expands and tightens his grip on the family crime syndicate."},
  {"title": "The Lord of the Rings: The Fellowship of the Ring", "genres": "Adventure,Fantasy,Action", "description": "A meek Hobbit and eight companions set out on a journey to destroy the One Ring."},
  {"title": "The Lord of the Rings: The Two Towers", "genres": "Adventure,Fantasy,Action", "description": "While Frodo and Sam edge closer to Mordor, the divided fellowship makes a stand against Sauron's new ally."},
  {"title": "The Lord of the Rings: The Return of the King", "genres": "Adventure,Fantasy,Action", "description": "Gandalf and Aragorn lead the World of Men against Sauron's army to draw his gaze from Frodo and Sam."},
  {"title": "Star Wars: Episode IV - A New Hope", "genres": "Sci-Fi,Adventure,Action", "description": "Luke Skywalker joins forces with a Jedi Knight, a cocky pilot, and two droids to save the galaxy."},
  {"title": "Star Wars: Episode V - The Empire Strikes Back", "genres": "Sci-Fi,Adventure,Action", "description": "After the Rebels are brutally overpowered, Luke begins Jedi training with Yoda."},
  {"title": "Star Wars: Episode VI - Return of the Jedi", "genres": "Sci-Fi,Adventure,Action", "description": "After rescuing Han Solo, the Rebels attempt to destroy the second Death Star."},
  {"title": "Gladiator", "genres": "Action,Drama,Adventure", "description": "A former Roman General sets out to exact vengeance against the corrupt emperor."},
  {"title": "Jurassic Park", "genres": "Adventure,Sci-Fi,Thriller", "description": "During a preview tour, a theme park suffers a major power breakdown that allows its cloned dinosaur exhibits to run amok."},
  {"title": "Titanic", "genres": "Drama,Romance", "description": "A seventeen-year-old aristocrat falls in love with a kind but poor artist aboard the luxurious, ill-fated R.M.S. Titanic."},
  {"title": "Avatar", "genres": "Action,Adventure,Fantasy", "description": "A paraplegic Marine dispatched to the moon Pandora becomes torn between following orders and protecting an alien civilization."},
  {"title": "Avengers: Endgame", "genres": "Action,Adventure,Sci-Fi", "description": "After the devastating events of Infinity War, the Avengers assemble once more to reverse Thanos' actions."},
  {"title": "Black Panther", "genres": "Action,Adventure,Sci-Fi", "description": "T'Challa, heir to the hidden but advanced kingdom of Wakanda, must step forward to lead his people."},
  {"title": "Iron Man", "genres": "Action,Sci-Fi,Adventure", "description": "After being held captive, an industrialist creates a unique weaponized suit of armor to fight evil."},
  {"title": "Spider-Man: Into the Spider-Verse", "genres": "Animation,Action,Adventure", "description": "Teen Miles Morales becomes Spider-Man and meets other Spider-People from different dimensions."},
  {"title": "Coco", "genres": "Animation,Adventure,Family", "description": "Aspiring musician Miguel enters the Land of the Dead to find his great-great-grandfather."},
  {"title": "Toy Story", "genres": "Animation,Adventure,Comedy", "description": "A cowboy doll is profoundly threatened and jealous when a new spaceman figure supplants him as top toy."},
  {"title": "Finding Nemo", "genres": "Animation,Adventure,Comedy", "description": "After his son is captured, a timid clownfish sets out on a journey to bring him home."},
  {"title": "Up", "genres": "Animation,Adventure,Comedy", "description": "78-year-old Carl sets out to fulfill his dream to see the wilds of South America."},
  {"title": "Inside Out", "genres": "Animation,Adventure,Comedy", "description": "After young Riley is uprooted, her emotions conflict on how best to navigate a new city."},
  {"title": "The Lion King", "genres": "Animation,Adventure,Drama", "description": "Lion prince Simba and his father are targeted by his bitter uncle."},
  {"title": "Frozen", "genres": "Animation,Adventure,Comedy", "description": "When the newly crowned Queen Elsa accidentally uses her power to turn things into ice, her sister Anna teams up with a mountain man to change the weather condition."},
  {"title": "Shrek", "genres": "Animation,Adventure,Comedy", "description": "A mean lord exiles fairytale creatures to the swamp of a grumpy ogre."},
  {"title": "Monsters, Inc.", "genres": "Animation,Adventure,Comedy", "description": "In order to power the city, monsters have to scare children, but they are terribly afraid of being contaminated by children."},
  {"title": "Ratatouille", "genres": "Animation,Comedy,Family", "description": "A rat who can cook makes an unusual alliance with a young kitchen worker at a famous restaurant."},
  {"title": "WALL-E", "genres": "Animation,Adventure,Family", "description": "In the distant future, a small waste-collecting robot inadvertently embarks on a space journey."},
  {"title": "The Incredibles", "genres": "Animation,Action,Adventure", "description": "A family of undercover superheroes, while trying to live the quiet suburban life, are forced into action."},
  {"title": "Despicable Me", "genres": "Animation,Comedy,Family", "description": "When a criminal mastermind uses a trio of orphan girls as pawns for a grand scheme, he finds their love is profoundly changing him."},
  {"title": "Minions", "genres": "Animation,Adventure,Comedy", "description": "Minions Stuart, Kevin and Bob are recruited by Scarlet Overkill, a super-villain who, alongside her inventor husband Herb, hatches a plot to take over the world."},
  {"title": "Zootopia", "genres": "Animation,Adventure,Comedy", "description": "In a city of anthropomorphic animals, a bunny cop and a cynical con artist fox must work together to uncover a conspiracy."},
  {"title": "Moana", "genres": "Animation,Adventure,Comedy", "description": "In Ancient Polynesia, when a terrible curse incurred by the Demigod Maui reaches Moana's island, she answers the Ocean's call to seek out the Demigod to set things right."},
  {"title": "Big Hero 6", "genres": "Animation,Action,Adventure", "description": "A special bond develops between plus-sized inflatable robot Baymax, and prodigy Hiro Hamada."},
  {"title": "Tangled", "genres": "Animation,Adventure,Comedy", "description": "The magically long-haired Rapunzel has spent her entire life in a tower, but now that a runaway thief has stumbled upon her, she is about to discover the world for the first time."},
  {"title": "Brave", "genres": "Animation,Adventure,Comedy", "description": "Determined to make her own path in life, Princess Merida defies a custom that brings chaos to her kingdom."},
  {"title": "The Secret Life of Pets", "genres": "Animation,Adventure,Comedy", "description": "The quiet life of a terrier named Max is upended when his owner takes in Duke, a stray whom Max instantly dislikes."},
  {"title": "Sing", "genres": "Animation,Comedy,Family", "description": "In a city of humanoid animals, a hustling theater impresario's attempt to save his theater with a singing competition becomes grander than he anticipates."},
  {"title": "Madagascar", "genres": "Animation,Adventure,Comedy", "description": "A group of animals who have spent all their life in a New York zoo end up in the jungles of Madagascar."},
  {"title": "Ice Age", "genres": "Animation,Adventure,Comedy", "description": "Set during the Ice Age, a sabertooth tiger, a sloth, and a woolly mammoth find a lost human infant, and they try to return him to his tribe."},
  {"title": "Kung Fu Panda", "genres": "Animation,Action,Adventure", "description": "The Dragon Warrior has to clash against the savage Tai Lung as China's fate hangs in the balance."},
  {"title": "How to Train Your Dragon", "genres": "Animation,Action,Adventure", "description": "A hapless young Viking who aspires to hunt dragons becomes the unlikely friend of a young dragon himself."},
  {"title": "Mad Max: Fury Road", "genres": "Action,Adventure,Sci-Fi", "description": "In a post-apocalyptic wasteland, Max helps a rebellious woman and a group of female prisoners flee from tyranny."},
  {"title": "John Wick", "genres": "Action,Crime,Thriller", "description": "An ex-hit-man comes out of retirement to track down the gangsters that killed his dog and took everything from him."},
  {"title": "The Avengers", "genres": "Action,Adventure,Sci-Fi", "description": "Earth's mightiest heroes must come together and learn to fight as a team."}
]
